ДоставкаЗаказов/src/InformationRegisters/ЦеныПоставщиков/ЦеныПоставщиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныПоставщиков</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ДоставкаЗаказов/src/CommonModules/ОбщегоНазначенияВызовСервера/Module.bsl
#Область ПрограммныйИнтерфейс

// Получить цену покупки номенклатуры.
// 
// Параметры:
//  Дата - Дата
//  Контрагент - Строка
//  Номенклатура - Строка
// 
// Возвращаемое значение:
//  Число
Функция ПолучитьЦенуПокупкиНоменклатуры(Дата, Контрагент, Номенклатура) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Дата", 			Дата);
	Запрос.УстановитьПараметр("Контрагент", 	Контрагент);
	Запрос.УстановитьПараметр("Номенклатура", 	Номенклатура);
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Цена
	|ИЗ
	|	РегистрСведений.ЦеныПоставщиков.СрезПоследних(&Дата, 
	|													Контрагент 		= &Контрагент 
	|												    И Номенклатура 	= &Номенклатура)
	|";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Номенклатура.ЦенаПокупки;
	Иначе
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Цена;
		
	КонецЕсли;
	
КонецФункции

// Получить цену продажи номенклатуры.
// 
// Параметры:
//  Номенклатура - Строка
// 
// Возвращаемое значение:
//  Число
Функция ПолучитьЦенуПродажиНоменклатуры(Номенклатура) Экспорт
	
	Возврат Номенклатура.ЦенаПродажи;
	
КонецФункции

// Сообщение пользователю.
// 
// Параметры:
// Текст - Строка.
Процедура СообщениеПользователюСервер(Текст) Экспорт
	
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = (Текст);
	Сообщение.Сообщить();
	
КонецПроцедуры

// Проверка результата запроса.
// 
// Параметры:
// РезультатЗапроса - Структура.
// Текст - Строка.
// 
// Возвращаемое значение:
// Структура 
Функция ПроверкаРезультатаЗапроса(РезультатЗапроса, Текст) Экспорт
	Если РезультатЗапроса.Пустой() Тогда
		СообщениеПользователюСервер(Текст);
	КонецЕсли;
	
	Выборка	= РезультатЗапроса.Выбрать();
	Возврат Выборка;
		
КонецФункции

// Проверка результата запроса.
// 
// Параметры:
// Выборка - Структура.
// Параметр - Строка.
// 
// Возвращаемое значение:
// СписокЗначений.
// СтрокаТаблицыЗначений.
Функция ФормированиеСтруктурыОтбора(Выборка, Параметр) Экспорт
	
	НаименованиеСтруктуры = Новый СписокЗначений;
	Пока Выборка.Следующий() Цикл
		НаименованиеСтруктуры.Добавить(Строка(Параметр));
	КонецЦикла;
	
	Возврат НаименованиеСтруктуры;	
	
КонецФункции

// Проверка условий.
// 
// Параметры:
// Отказ - Булево.
// Условие - Булево.
// Текст - Строка.
Процедура ПроверкаУсловий (Отказ, Условие, Текст) Экспорт
	
	Если Условие Тогда 
		СообщениеПользователюСервер(Текст);
		Отказ = Истина;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти
